app/views/profiles/_profile.html.erb

SELECT `profile`.* FROM `profile` WHERE `profile`.`user_id` = 20 LIMIT 1
---
        <%= (current_fb_user.image).present?? (raw image_tag current_fb_user.image, :size => "100x40" ) : image_tag("annonymous_user.png") if !user_signed_in? %>
        <%= ((current_user.profile.image).present? ? (image_tag @profile.image, :size => "100x40", style: "padding-top: 10px;") : image_tag("annonymous_user.png")) if (user_signed_in? && !current_fb_user.present? && !current_twitter_user.present?) %>