app/views/profiles/_saved_property.html.erb

<% @saved_properties = SavedProperty.where("user_id = ?", @profile.user_id).order("created_at DESC") %>
<% @saved_properties.each do |saved_prop| %>
    <% properties = Property.where("id = ?", saved_prop.property_id) %>
---
SELECT `saved_properties`.* FROM `saved_properties` WHERE (user_id = 20) ORDER BY created_at DESC
SELECT `properties`.* FROM `properties` WHERE (id = 28910)