app/views/home/_adv_search.html.erb

    <%= label_tag :price_min %>
    <% min_value = Property.minimum(:property_price) %>
---
SELECT MIN(`properties`.`property_price`) AS min_id FROM `properties`
SELECT `properties`.* FROM `properties`