app/views/home/_result.html.erb

        <% @saved_property = link_to "Saved", "/profiles/#{@user.profile.id}#tab2", class: "saved" %>
        <% @saved_prop_present = SavedProperty.where("property_id = ?",result.id).present? %>
---
SELECT `saved_properties`.* FROM `saved_properties` WHERE (property_id = 28910)