app/controllers/home_controller.rb

SELECT `properties`.* FROM `properties`
---
  def adv_search
    @properties = Property.all

SELECT `properties`.* FROM `properties`
---
  def results
    #raise params.inspect
    @properties = Property.all

INSERT INTO `saved_properties` (`created_at`, `property_id`, `updated_at`, `user_id`) VALUES ('2013-01-21 08:13:24', 28910, '2013-01-21 08:13:24', NULL)
---
  def saved_properties
    @prop_id = params[:property_id]
    @user_id = params[:user_id]
    @saved_prop_present = SavedProperty.where("property_id = ? AND user_id = ?", @prop_id, @user_id).present?
    if !@saved_prop_present
      @saved_prop = SavedProperty.create(:property_id => @prop_id, :user_id => @user_id)

DELETE FROM `saved_properties` WHERE `saved_properties`.`id` = 91
SELECT `saved_properties`.* FROM `saved_properties` WHERE (property_id = '28912' AND user_id = '20')
---
  def remove_save_prop
    @rm_prop_id = params[:property_id]
    user_id = params[:user_id]
    SavedProperty.where("property_id = ? AND user_id = ?", @rm_prop_id, user_id).destroy_all