app/controllers/profiles_controller.rb

SELECT `profile`.* FROM `profile` WHERE `profile`.`id` = 12 LIMIT 1
---
  def show
    @profile = Profile.find(params[:id])